### Agenda:

##### Machine Learning Steps:
1. Data Ingestion
2. EDA
3. Feature Engineering ( or Preprocessing)
4. Model Building
**(Applying alogorithm on the Data) (models are Mathematical equaltions just algorithms applied on the data )**
6. Evaluation of The Model

# FEATURE ENGINEERING

**WHY WE PERFORM FEATURE ENGINEERING?**

 We can find the real world data is quite messy, it has lots of missing values, not encoded properly, scalig is one major thing , so many unneccessary features are there from that we need to find which are majorly responsible for predication and so many more things . To solve these issues we need something called Feature Engineering which will make our messy data into proper useful dataset using various steps of feature engineering

Why to encode ? Because we have categorical data also inside our dataset and we cannot pass non numeric data to out model , as mathematical equation wont get perform on top of it...so we need to encode those categorical data into numerical and then need to pass to the model (mathematical equations or algorithms)

Ways for Performing Feature Enigineering:
1. **Feature Transformation**: We have missing value ..we have to handle those missing value, distribution transformation,Outlier Handling,we can also transform those outlier to some value(if needed),Scaling
   * Missing Value Handling
   * Outlier Handling
   * Scaling (Standarization,MinMaxSaling)
   * Encloding (Categorical data to numeric data)
   * Other Transformation (Distribution : LogTransformation,ExponentialTransformation,Box-Cox Transformation)
   
2. **Feature Construction**:**(Merging or Splitting)**
   We can construct /merge the feature , we can split the feature.
   * newc_col = col1 + col2        Construct new feature by combining two other feature based on some logic.
     Also we need to Compare the Performace that whether single features are giving good results of the combination. (Machine learning is all about the experiments)
   * eg. Titanic : data['Family'] = data['Parch'] + data['SibSp']
   * eg. data["Ticket"] we can segregate alphabets and numeric vaues.
   * eg. Suppose there is a column which has messy data like consists of categorical and numeric values. Then How can we handle that data.
   
     
   
   
3. **Feature Selection**:We take subset of the data.We are taking Important features from the data.
   Sometimes we do it and sometimes we dont do it usally depends on the problem statement.
   So we create model without Feature selection and with feature selection and checks model accuracy increased or not..If Instead of increasing it decreased This is Called Curse of Dimensionality.
   
4.**Feature Extraction**: Here We talk about Dimensionality Reducation (Using PCA,tsne,LDA)
Feature selection and feature extraction is quite same...but the mathematical aspects are different. We merege all feature and represent in terms of single feature Using PCA , t-sne,LDA.

Feature Selection and Extraction are interchangable terms...works alike..But for Feature Selection we have certain technique and for feature extraction we have some certain technique.

Feature Selection and Feature Extraction both Dimensionality reduction techniques...Mathematical approach is diff.

# Lets Start

One warning came that pandas is dependent on pyarrow so thats why install pyarrow nothing much   pip install pyarrow

In [1]:
import pandas as pd

import warnings
warnings.filterwarnings('ignore')

In [2]:
data=pd.read_csv("https://raw.githubusercontent.com/shivang98/Social-Network-ads-Boost/master/Social_Network_Ads.csv")

In [3]:
data.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [4]:
print("Number of Rows:",data.shape[0])
print("Number of Columns:",data.shape[1])

Number of Rows: 400
Number of Columns: 5

In [5]:
print("Name of the Columns:",list(data.columns))

Name of the Columns: ['User ID', 'Gender', 'Age', 'EstimatedSalary', 'Purchased']

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   User ID          400 non-null    int64
 1   Gender           400 non-null    object
 2   Age              400 non-null    int64
 3   EstimatedSalary  400 non-null    int64
 4   Purchased        400 non-null    int64
dtypes: int64(4), object(1)
memory usage: 15.8+ KB

In [7]:
# Checking is there any missing values or not.
data.isnull().sum()

User ID            0
Gender             0
Age                0
EstimatedSalary    0
Purchased          0
dtype: int64

In [8]:
# No missing values are there...

In [9]:
#Lets see for dupliacte values..
data[data.duplicated()]  # This shows no duplicate values are there..

Empty DataFrame
Columns: [User ID, Gender, Age, EstimatedSalary, Purchased]
Index: []

In [10]:
# Lets understand the data...Using nunique and unqiue values..
# Based on Data Basic Analysis is that..Gender and Purchased Must be Categorical...and Age and EstimatedSalary must be numerical
# So lets change the datatype of it for proper analysis..
# We can see Purchased must be in Categorical values...lets make them object from int64.

data['Purchased']=data['Purchased'].astype('object')  # Now this is fine..

In [11]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   User ID          400 non-null    int64
 1   Gender           400 non-null    object
 2   Age              400 non-null    int64
 3   EstimatedSalary  400 non-null    int64
 4   Purchased        400 non-null    object
dtypes: int64(3), object(2)
memory usage: 15.8+ KB

In [12]:
# Lets see the mathematical Insgihts of the dataset..
data.describe().T   # This is by default measures given by describe() method..This is bascially data.describe(exclude='object')

,count,mean,std,min,25%,50%,75%,max
User ID,400.0,1.569154e+07,71658.321581,15566689.0,15626763.75,15694341.5,15750363.0,15815236.0
Age,400.0,3.765500e+01,10.482877,18.0,29.75,37.0,46.0,60.0
EstimatedSalary,400.0,6.974250e+04,34096.960282,15000.0,43000.00,70000.0,88000.0,150000.0

In [13]:
data.describe(include='object').T   # Shows about the Non Numeric Values

          count unique     top freq
Gender      400      2  Female  204
Purchased   400      2       0  257

In [14]:
# Since we know id is of no use for us in data analysis...so its better to drop it.

data.drop(columns=['User ID'],inplace=True)
data.head()

   Gender  Age  EstimatedSalary Purchased
0    Male   19            19000         0
1    Male   35            20000         0
2  Female   26            43000         0
3  Female   27            57000         0
4    Male   19            76000         0

In [15]:
# From data.describe(include='object').T  we already came to know about Gender has 2 unique values and Purchased has two unique values..

print(f"Gender has  {data['Gender'].nunique()} unique values and those are {data['Gender'].unique()}")
print(f"Gender has  {data['Purchased'].nunique()} unique values and those are {data['Purchased'].unique()}")

Gender has  2 unique values and those are ['Male' 'Female']
Gender has  2 unique values and those are [0 1]

In [16]:
# Lets Segregate the Numerical and Categorical Data using select_dtype() method .

categorical_data = data.select_dtypes(include='object')
numerical_data = data.select_dtypes(exclude='object')

In [17]:
categorical_cols= list(categorical_data.columns)
numerical_cols = list(numerical_data.columns)

In [18]:
categorical_cols

['Gender', 'Purchased']

In [19]:
numerical_cols

['Age', 'EstimatedSalary']

In [20]:
data.head()

   Gender  Age  EstimatedSalary Purchased
0    Male   19            19000         0
1    Male   35            20000         0
2  Female   26            43000         0
3  Female   27            57000         0
4    Male   19            76000         0

Here we can see Age is in 10s's and EstimatedSalary in 10K range..
So Since Target column is Categorical so we will used such algorithms which are majorly distance based..
If the Scale is this must different the One feature will dominate and other's effect vanishes.
So to Prevent this issue we need to Sacle the data in same scale so that we can perform out distance based algorthims 
appropriately which leds to best performance.

ALso If Regression Problems also...like Linear Regression , Logsitic Regression,SVM...These also got impacted a lot,Beacuse For Optimization we use Gradient Descent.

Classification Problem : KNN (Supervised)(This is a Technique and not a Algorithm) ,K_means(Unsupervised) for Clustering

**Always Take Care of this Perform the Feature Engineering on Train Data only..**
**Not on Test data and not on Validation data**

If we going to Perform this Feature Engineering technique on train as well as on test data...this will leads to **Data Leakage**

Only Perform FE on Training Data and Not on Test Data

* Always do fit and transform on train data using fit_transform()
* But always fo transform only on the test data using transform()

#### Splitting the Data In Train Test data (

This is to avoid DataLeakage and fit_transform only on training data and transform() in test data)

In [21]:
# Lets First Segregate the Data into Independent and Depenedent Data.
X=data.drop( columns=['Purchased'])
y=data['Purchased']

In [22]:
from sklearn.model_selection import train_test_split

In [23]:
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size=0.2,random_state=42)

In [24]:
X_train.shape

(320, 3)

In [25]:
X_test.shape

(80, 3)

### Need TO Perform Scaling : Compress our data within a Range

In [26]:
import sklearn

In [27]:
from sklearn.preprocessing import StandardScaler